In [36]:
import pandas as pd

df = pd.read_csv('co2_mm_mlo.csv', sep='\s+', header=None)
df.head()

      0  1         2       3       4       5  6
0  1958  3  1958.208  315.71  315.71  314.62 -1
1  1958  4  1958.292  317.45  317.45  315.29 -1
2  1958  5  1958.375  317.50  317.50  314.71 -1
3  1958  6  1958.458  -99.99  317.10  314.85 -1
4  1958  7  1958.542  315.86  315.86  314.98 -1

In [37]:
df = df.iloc[:, [0,1,3]]

In [38]:
df.columns = ["Year", "Month", "CO2"]

In [39]:
df['Day'] = 15
df.head()

   Year  Month     CO2  Day
0  1958      3  315.71   15
1  1958      4  317.45   15
2  1958      5  317.50   15
3  1958      6  -99.99   15
4  1958      7  315.86   15

In [40]:
df['Date'] = pd.to_datetime(df.Year*10000+df.Month*100+df.Day,format='%Y%m%d')
df.head()

   Year  Month     CO2  Day       Date
0  1958      3  315.71   15 1958-03-15
1  1958      4  317.45   15 1958-04-15
2  1958      5  317.50   15 1958-05-15
3  1958      6  -99.99   15 1958-06-15
4  1958      7  315.86   15 1958-07-15

In [41]:
df.drop(['Day'], axis=1, inplace=True)

In [48]:
df[['Year', 'CO2']].groupby('Year').mean()

             CO2
Year
1958  232.267000
1959  315.974167
1960  316.907500
1961  317.637500
1962  318.450833
1963  318.994167
1964  214.405833
1965  320.044167
1966  321.383333
1967  322.157500
1968  323.045000
1969  324.624167
1970  325.680000
1971  326.320000
1972  327.453333
1973  329.676667
1974  330.185000
1975  295.233333
1976  332.040000
1977  333.831667
1978  335.403333
1979  336.841667
1980  338.751667
1981  340.105833
1982  341.447500
1983  343.054167
1984  307.415000
1985  346.116667
1986  347.420833
1987  349.194167
...          ...
1990  354.394167
1991  355.607500
1992  356.445833
1993  357.100000
1994  358.833333
1995  360.820000
1996  362.606667
1997  363.729167
1998  366.700000
1999  368.377500
2000  369.550000
2001  371.142500
2002  373.279167
2003  375.802500
2004  377.522500
2005  379.795833
2006  381.896667
2007  383.791667
2008  385.604167
2009  387.430000
2010  389.899167
2011  391.652500
2012  393.853333
2013  396.520833
2014  398.647500
2015  400.834167
2016  404.239167
2017  406.553333
2018  408.521667
2019  411.290000

[62 rows x 1 columns]